app/controllers/home_controller.rb

SELECT * FROM `stores`
---
  def index
    @cars       = Vehicle.carros
    @bikes      = Vehicle.motos
    @partners   = Partner.parceiros
    @stores     = Store.find :all